jlckfb/Candis-S31/examples/esp-idf/player/sdkconfig.defaults
# Candis-S31 full-screen MJPEG player baseline.
# Uses QIO 80 MHz Flash and 250 MHz Octal PSRAM validated on EVT1.
CONFIG_IDF_TARGET="esp32s31"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Report peripheral failures instead of aborting on them.
CONFIG_BSP_ERROR_CHECK=n

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Single 8 MB app partition (no OTA); see partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# PSRAM: octal mode, 250 MHz (EVT1-validated setting).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_MEMTEST=y

# Move the general heap into PSRAM.
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Display: QSPI 48 MHz, LVGL PARTIAL, two internal-DMA buffers.
CONFIG_BSP_LCD_PIXEL_CLOCK_MHZ=48
CONFIG_BSP_LCD_TE_SYNC=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=n
CONFIG_LV_DISP_DEF_REFR_PERIOD=10
CONFIG_LV_INDEV_DEF_READ_PERIOD=10
CONFIG_BSP_LCD_DRAW_BUF_HEIGHT=48
CONFIG_BSP_LCD_DRAW_BUF_DOUBLE=y

# LVGL draw settings.
CONFIG_LV_USE_STDLIB_MALLOC=y
CONFIG_LV_USE_STDLIB_STRING=y
CONFIG_LV_USE_STDLIB_SPRINTF=y
CONFIG_LV_USE_PPA=n
CONFIG_LV_DRAW_BUF_ALIGN=64
CONFIG_LV_FONT_MONTSERRAT_16=y

# 1 ms tick.
CONFIG_FREERTOS_HZ=1000

# app_main stack.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Keep LVGL allocations in a bounded private pool.
CONFIG_LV_MEM_SIZE_KILOBYTES=64

# Fonts.
CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_16_CJK=n
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_24=y

# Disable WiFi/BLE to save internal RAM; the player is offline.
CONFIG_BT_ENABLED=n
CONFIG_ESP_WIFI_ENABLED=n

# FATFS long filenames and code page for SD card file names.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_CODEPAGE_936=y
